БухЭксп/Documents/CW_КорректировкаРегистров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>CW_КорректировкаРегистров</Name>
			<Posting>Deny</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.CW_ПеревыставлениеПоСтавкам</xr:Item>
				<xr:Item>AccumulationRegister.CW_РаботаВодителей</xr:Item>
				<xr:Item>AccumulationRegister.CW_ЗаправкиПодотчетныхЛиц</xr:Item>
				<xr:Item>AccumulationRegister.CW_РасходыПоГрузоперевозкамТранспортныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.CW_КурсовыеРазницы</xr:Item>
				<xr:Item>InformationRegister.CW_СостоянияТС</xr:Item>
				<xr:Item>AccountingRegister.CW_МСФО</xr:Item>
				<xr:Item>AccumulationRegister.CW_ОперативнаяКредиторскаяЗадолженность</xr:Item>
				<xr:Item>AccumulationRegister.CW_ТопливоТС</xr:Item>
				<xr:Item>AccumulationRegister.CW_ДенежныеСредства</xr:Item>
				<xr:Item>InformationRegister.CW_УслугиПоДоговоруГрузоперевозки</xr:Item>
				<xr:Item>AccumulationRegister.CW_ПробегШин</xr:Item>
				<xr:Item>AccumulationRegister.CW_НезавершенноеПроизводство</xr:Item>
				<xr:Item>AccumulationRegister.CW_ОперативнаяДебиторскаяЗадолженность</xr:Item>
				<xr:Item>AccumulationRegister.CW_ОплатаИсходящихСчетов</xr:Item>
				<xr:Item>AccumulationRegister.CW_ЗаправкиТопливнымиКартами</xr:Item>
				<xr:Item>AccumulationRegister.CW_ОплатаВходящихСчетов</xr:Item>
				<xr:Item>InformationRegister.CW_ПараметрыТС</xr:Item>
				<xr:Item>InformationRegister.CW_СоответствиеАктовВходящимСчетам</xr:Item>
				<xr:Item>AccumulationRegister.CW_Перевыставление</xr:Item>
				<xr:Item>AccumulationRegister.CW_РасходГСМТС</xr:Item>
				<xr:Item>AccumulationRegister.CW_ВознаграждениеПоГрузоперевозкам</xr:Item>
				<xr:Item>InformationRegister.CW_ПрайсыКонтрагентов</xr:Item>
				<xr:Item>InformationRegister.CW_ШиныТС</xr:Item>
				<xr:Item>AccumulationRegister.CW_ОплатыПокупателейУСН</xr:Item>
				<xr:Item>InformationRegister.CW_ОплатаВходящихДокументов</xr:Item>
				<xr:Item>AccumulationRegister.CW_АктированиеИсходящихСчетов</xr:Item>
				<xr:Item>AccumulationRegister.CW_ПробегТС</xr:Item>
				<xr:Item>AccumulationRegister.CW_АктированиеВходящихСчетов</xr:Item>
				<xr:Item>AccumulationRegister.CW_ДоходыПоГрузоперевозкам</xr:Item>
				<xr:Item>AccumulationRegister.CW_РасходыПоПриобретениям</xr:Item>
				<xr:Item>InformationRegister.CW_ПоказанияОдометровТранспортныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.CW_ЗарплатаВодителейТС</xr:Item>
				<xr:Item>InformationRegister.CW_РаспределениеОплатПокупателейУСН</xr:Item>
				<xr:Item>InformationRegister.CW_ДТГрузоперевозок</xr:Item>
				<xr:Item>InformationRegister.CW_СоответствиеАктовИсходящимСчетам</xr:Item>
				<xr:Item>AccumulationRegister.CW_РасходыПоГрузоперевозкам</xr:Item>
				<xr:Item>InformationRegister.CW_ОплатаИсходящихДокументов</xr:Item>
				<xr:Item>AccumulationRegister.CW_РасходыНаРеализацию</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗаполнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СторнируемыйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПодотчетногоЛица</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_КорректировкаОперативнойЗадолженности</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_УстановкаПараметровТС</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоПриобретениям</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_УслугиПоДоговоруГрузоперевозки</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ДвижениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_КорректировкаРаспределенияОплатДляУСН</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ШиномонтажТС</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РаспределениеЗатратПутевыхЛистовПоГрузоперевозкам</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_КорректировкаАктированияСчетов</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РеестрПлатежей</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РучнаяОперация</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ПоступлениеТС</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_Оплата</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ПрайсКонтрагента</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ЗакрытиеГрузоперевозки</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ПутевойЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_DT_ТранспортноеСообщениеИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_КорректировкаПеревыставления</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РеализацияПрочихТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_DT_ТранспортноеСообщениеВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ПроектыДТ</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_СписаниеЗатратНаРеализацию</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ОтчетЭкспедитора</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ВыбытиеТС</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ВводОстатковНезавершенногоПроизводства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизвольнаяДатаДвижений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОперации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаРегистровСведений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаРегистровНакопления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗаполнениеДвижений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/Documents/CW_КорректировкаРегистров/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Перем ИдентификаторСтрокиПроводки;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Ключ.Пустая() Тогда
		CW_Документы.ЗаполнениеДокументов(Объект);
		ПодготовитьФормуНаСервере();
	КонецЕсли;	
	
	ПриИзмененииВидаДатыДвижений();

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	ПодготовитьФормуНаСервере();
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Документ.CW_КорректировкаРегистров.Форма.ФормаНастройки" Тогда
		Если ТипЗнч(ВыбранноеЗначение) = Тип("СписокЗначений")
		   И ВыбранноеЗначение.Количество() <> 0 Тогда
		   
			Модифицированность = Истина;
			ПрименитьНастройкуСоставаРегистров(ВыбранноеЗначение);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.СпособЗаполнения = СпособЗаполненияВручную Тогда
		ТекущийОбъект.ЗаполнениеДвижений.Очистить();
		ТекущийОбъект.СторнируемыйДокумент = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИзменитьПараметрыВыбораПолейСубконто(ЭтотОбъект, "Дт");
	ИзменитьПараметрыВыбораПолейСубконто(ЭтотОбъект, "Кт");

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)


КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ТекущаяОрганизация = Объект.Организация;
	
КонецПроцедуры


&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	// Запомним новую дату документа.
	ТекущаяДатаДокумента = Объект.Дата;
	
КонецПроцедуры

&НаКлиенте
Процедура СпособЗаполненияПриИзменении(Элемент)

	ОбновлениеОтображения();

КонецПроцедуры

&НаКлиенте
Процедура ФлажокСписокПриИзменении(Элемент)

	ОбновлениеОтображения();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиМСФО

&НаСервере
Процедура ЗаполнитьДобавленныеКолонкиТаблиц()

	ПоляОбъектаДт = Новый Структура(
		"Субконто1, Субконто2, Субконто3, Подразделение, Валютный, Количественный",
		"СубконтоДт1", "СубконтоДт2", "СубконтоДт3", "ПодразделениеДт", "ВалютныйДт", "КоличественныйДт");
	ПоляОбъектаКт = Новый Структура(
		"Субконто1, Субконто2, Субконто3, Подразделение, Валютный, Количественный",
		"СубконтоКт1", "СубконтоКт2", "СубконтоКт3", "ПодразделениеКт", "ВалютныйКт", "КоличественныйКт");

	Для каждого Проводка Из Объект.Движения.CW_МСФО Цикл
		CW_БухгалтерскийУчетКлиентСерверМСФО.УстановитьДоступностьСубконто(Проводка.СчетДт, Проводка, ПоляОбъектаДт, Ложь);
		CW_БухгалтерскийУчетКлиентСерверМСФО.УстановитьДоступностьСубконто(Проводка.СчетКт, Проводка, ПоляОбъектаКт, Ложь);
		ЗаполнитьНадписиВПроводке(Проводка, "Дт");
		ЗаполнитьНадписиВПроводке(Проводка, "Кт");
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьНадписиВПроводке(Проводка, ДтКт)
	
	Проводка["НадписьКоличество"+ДтКт] 	= ?(Проводка["Количественный"+ДтКт+"Доступность"]	, "Кол.:", "");
	Проводка["НадписьВалюта"+ДтКт] 		= ?(Проводка["Валютный"+ДтКт+"Доступность"]			, "Вал.:", "");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавленныеКолонкиТаблицПоСтроке(ИдентификаторСтроки, ДтКт)
	
	ПоляОбъекта = Новый Структура(
		"Субконто1, Субконто2, Субконто3, Подразделение, Валютный, Количественный",
		"Субконто"+ДтКт+"1", "Субконто"+ДтКт+"2", "Субконто"+ДтКт+"3", "Подразделение"+ДтКт, "Валютный"+ДтКт, "Количественный"+ДтКт);

	Проводка = Объект.Движения.CW_МСФО.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	CW_БухгалтерскийУчетКлиентСерверМСФО.УстановитьДоступностьСубконто(Проводка["Счет"+ДтКт], Проводка, ПоляОбъекта, Ложь);
	ЗаполнитьНадписиВПроводке(Проводка, ДтКт);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ИзменитьПараметрыВыбораПолейСубконто(Форма, ДтКт = "", ОчищатьСвязанныеСубконто = Истина)
	
	СтрокаТаблицы = Форма.Элементы.ЖурналПроводокМСФО.ТекущиеДанные;
	Если СтрокаТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДтКт <> "Кт" Тогда
		
		ПараметрыДокумента = ПолучитьСписокПараметров(Форма, СтрокаТаблицы, "СубконтоДт%Индекс%", "СчетДт");
		
		Если ОчищатьСвязанныеСубконто Тогда
			ЗначенияСубконтоСтрокиТаблицы = СтрокаТаблицы;
		Иначе
			ЗначенияСубконтоСтрокиТаблицы = Новый Структура("СубконтоДт1,СубконтоДт2,СубконтоДт3");
			ЗаполнитьЗначенияСвойств(ЗначенияСубконтоСтрокиТаблицы, СтрокаТаблицы);
		КонецЕсли;
		
		CW_БухгалтерскийУчетКлиентСерверМСФО.ИзменитьПараметрыВыбораПолейСубконто(
			Форма, ЗначенияСубконтоСтрокиТаблицы, "СубконтоДт%Индекс%", "ЖурналПроводокМСФОСубконтоДт%Индекс%", ПараметрыДокумента);
			
	КонецЕсли;
	Если ДтКт <> "Дт" Тогда
		
		ПараметрыДокумента = ПолучитьСписокПараметров(Форма, СтрокаТаблицы, "СубконтоКт%Индекс%", "СчетКт");
		
		Если ОчищатьСвязанныеСубконто Тогда
			ЗначенияСубконтоСтрокиТаблицы = СтрокаТаблицы;
		Иначе
			ЗначенияСубконтоСтрокиТаблицы = Новый Структура("СубконтоКт1,СубконтоКт2,СубконтоКт3");
			ЗаполнитьЗначенияСвойств(ЗначенияСубконтоСтрокиТаблицы, СтрокаТаблицы);
		КонецЕсли;
		
		CW_БухгалтерскийУчетКлиентСерверМСФО.ИзменитьПараметрыВыбораПолейСубконто(
			Форма, ЗначенияСубконтоСтрокиТаблицы, "СубконтоКт%Индекс%", "ЖурналПроводокМСФОСубконтоКт%Индекс%", ПараметрыДокумента);
			
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьСписокПараметров(Форма, ТекущиеДанные, ШаблонИмяПоляОбъекта, ИмяПоляСчетУчета)

	СписокПараметров = Новый Структура("Организация,СчетУчета,ОстаткиОбороты",
		Форма.Объект.Организация, ТекущиеДанные[ИмяПоляСчетУчета], "Кт");
	ТипыДоговора = CW_БухгалтерскийУчетКлиентСерверПереопределяемыйМСФО.ПолучитьОписаниеТиповДоговора().Типы();
	Для Индекс = 1 По 3 Цикл
		ИмяПоля    = СтрЗаменить(ШаблонИмяПоляОбъекта, "%Индекс%", Индекс);
		ДанныеПоля = ТекущиеДанные[ИмяПоля];
		ТипПоля    = ТипЗнч(ДанныеПоля);
		Если ТипПоля = Тип("СправочникСсылка.Контрагенты") Тогда
			СписокПараметров.Вставить("Контрагент", ДанныеПоля);
		ИначеЕсли ТипыДоговора.Найти(ТипПоля) <> Неопределено Тогда
			СписокПараметров.Вставить("Договор", ДанныеПоля);
		ИначеЕсли ТипПоля = Тип("СправочникСсылка.Номенклатура") Тогда
			СписокПараметров.Вставить("Номенклатура", ДанныеПоля);
		ИначеЕсли ТипПоля = Тип("СправочникСсылка.Склады") Тогда
			СписокПараметров.Вставить("Склад", ДанныеПоля);
		КонецЕсли;
	КонецЦикла;

	Возврат СписокПараметров;

КонецФункции

&НаКлиенте
Процедура ОбработатьНачалоВыбораСубконто(ДтКт, Элемент, СтандартнаяОбработка)

	ТекущиеДанные      = Элементы.ЖурналПроводокМСФО.ТекущиеДанные;
	ПараметрыДокумента = ПолучитьСписокПараметров(ЭтотОбъект, ТекущиеДанные, "Субконто" + ДтКт + "%Индекс%", "Счет" + ДтКт);
	ОбщегоНазначенияБПКлиент.НачалоВыбораЗначенияСубконто(ЭтотОбъект, Элемент, СтандартнаяОбработка, ПараметрыДокумента);

КонецПроцедуры    

&НаКлиенте
Процедура ЖурналПроводокМСФОПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.ЖурналПроводокМСФО.ТекущиеДанные;
	ИдСтроки      = Элементы.ЖурналПроводокМСФО.ТекущаяСтрока;
	
	Если ИдСтроки <> ИдентификаторСтрокиПроводки Тогда
	
		ПоляФормы = Новый Структура("Субконто1, Субконто2, Субконто3",
			"ЖурналПроводокМСФОСубконтоДт1", "ЖурналПроводокМСФОСубконтоДт2", "ЖурналПроводокМСФОСубконтоДт3");
		CW_БухгалтерскийУчетКлиентСерверМСФО.ПриВыбореСчета(ТекущиеДанные.СчетДт, ЭтотОбъект, ПоляФормы, Неопределено, Истина, Ложь);
	
		ПоляФормы = Новый Структура("Субконто1, Субконто2, Субконто3",
			"ЖурналПроводокМСФОСубконтоКт1", "ЖурналПроводокМСФОСубконтоКт2", "ЖурналПроводокМСФОСубконтоКт3");
		CW_БухгалтерскийУчетКлиентСерверМСФО.ПриВыбореСчета(ТекущиеДанные.СчетКт, ЭтотОбъект, ПоляФормы, Неопределено, Истина, Ложь);
		
		ИзменитьПараметрыВыбораПолейСубконто(ЭтотОбъект, "", Ложь);
		
		ИдентификаторСтрокиПроводки = ИдСтроки;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчитатьСуммуОперации(Форма)
	
	Форма.Объект.СуммаОперации = Форма.Объект.Движения.CW_МСФО.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура ЖурналПроводокМСФОПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	 ПересчитатьСуммуОперации(ЭтотОбъект)
КонецПроцедуры

//ДЕБЕТ
&НаКлиенте
Процедура ЖурналПроводокМСФОСубконтоДт1ПриИзменении(Элемент)
	ИзменитьПараметрыВыбораПолейСубконто(ЭтотОбъект, "Дт");
КонецПроцедуры

&НаКлиенте
Процедура ЖурналПроводокМСФОСубконтоДт2ПриИзменении(Элемент)
	ИзменитьПараметрыВыбораПолейСубконто(ЭтотОбъект, "Дт");
КонецПроцедуры

&НаКлиенте
Процедура ЖурналПроводокМСФОСубконтоДт1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбработатьНачалоВыбораСубконто("Дт", Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ЖурналПроводокМСФОСубконтоДт2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбработатьНачалоВыбораСубконто("Дт", Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ЖурналПроводокМСФОСубконтоДт3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбработатьНачалоВыбораСубконто("Дт", Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ЖурналПроводокМСФОСчетДтПриИзменении(Элемент)

	ИдентификаторСтроки = Элементы.ЖурналПроводокМСФО.ТекущиеДанные.ПолучитьИдентификатор();
	
	ЗаполнитьДобавленныеКолонкиТаблицПоСтроке(ИдентификаторСтроки, "Дт");
	
КонецПроцедуры

&НаКлиенте
Процедура ЖурналПроводокМСФОВалютнаяСуммаДтПриИзменении(Элемент)
	

КонецПроцедуры

//КРЕДИТ
&НаКлиенте
Процедура ЖурналПроводокМСФОСубконтоКт1ПриИзменении(Элемент)
	ИзменитьПараметрыВыбораПолейСубконто(ЭтотОбъект, "Кт");
КонецПроцедуры

&НаКлиенте
Процедура ЖурналПроводокМСФОСубконтоКт2ПриИзменении(Элемент)
	ИзменитьПараметрыВыбораПолейСубконто(ЭтотОбъект, "Кт");
КонецПроцедуры

&НаКлиенте
Процедура ЖурналПроводокМСФОСубконтоКт1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбработатьНачалоВыбораСубконто("Кт", Элемент, СтандартнаяОбработка);
КонецПроцедуры


&НаКлиенте
Процедура ЖурналПроводокМСФОСубконтоКт2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбработатьНачалоВыбораСубконто("Кт", Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ЖурналПроводокМСФОСубконтоКт3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбработатьНачалоВыбораСубконто("Кт", Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ЖурналПроводокМСФОВалютнаяСуммаКтПриИзменении(Элемент)
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЖурналПроводокМСФОСчетКтПриИзменении(Элемент)
	
	ИдентификаторСтроки = Элементы.ЖурналПроводокМСФО.ТекущиеДанные.ПолучитьИдентификатор();
	ЗаполнитьДобавленныеКолонкиТаблицПоСтроке(ИдентификаторСтроки, "Кт");
	
КонецПроцедуры

&НаКлиенте
Процедура ЖурналПроводокМСФОВалютаДтПриИзменении(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ЖурналПроводокМСФОВалютаКтПриИзменении(Элемент)
	
КонецПроцедуры



#КонецОбласти

#Область ОбработчикиСобытийСписковРегистров

// Общая процедура для всех регистров. Устанавливает период и организацию в добавляемых строках.
//
&НаКлиенте
Процедура Подключаемый_ТаблицаРегистраПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Элемент.ТекущиеДанные.Свойство("Период") Тогда
		Если НЕ Объект.ПроизвольнаяДатаДвижений ИЛИ НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.Период) Тогда
			Элемент.ТекущиеДанные.Период = Объект.Дата;
		КонецЕсли;
	КонецЕсли;

	Если НоваяСтрока
			И НЕ Копирование
			И Элемент.ТекущиеДанные.Свойство("Организация")
			И ЗначениеЗаполнено(Объект.Организация) Тогда
		Элемент.ТекущиеДанные.Организация = Объект.Организация;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастроитьСоставРегистров(Команда)

	АдресСпискаРегистров = ПодготовитьСписокРегистровДляЕгоНастройки();
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("АдресСпискаРегистров", АдресСпискаРегистров);
	
	ОткрытьФорму("Документ.CW_КорректировкаРегистров.Форма.ФормаНастройки", СтруктураПараметров, ЭтаФорма);
		
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьАктивностьПроводок(Команда)

	Если Объект.ПометкаУдаления Тогда
		ПоказатьПредупреждение(Неопределено, НСтр(
		"ru = 'Документ помечен на удаление, 
        |поэтому переключить активность проводок нельзя.
        |Снимите пометку удаления.'"));
		Возврат;
	КонецЕсли;
	
	ПереключитьАктивностьПроводокСервер();

КонецПроцедуры

&НаСервере
Процедура ПереключитьАктивностьПроводокСервер()

	ТекущаяАктивность = Ложь;
	ТекущаяСтраница = СтрЗаменить(Элементы.ПанельРегистров.ТекущаяСтраница.Имя,"Группа","");
	Если Объект.Движения[ТекущаяСтраница].Количество() > 0 Тогда
		ТекущаяАктивность = Объект.Движения[ТекущаяСтраница][0].Активность;
	КонецЕсли;
	
	СтрокиРег = Регистры.НайтиСтроки(Новый Структура("Имя",ТекущаяСтраница));
	Если СтрокиРег.Количество()>0 Тогда
		Если СтрокиРег[0].ТипРегистра = "РегистрСведений" Тогда
			НаборЗаписейРС = ДанныеФормыВЗначение(Объект.Движения[ТекущаяСтраница],Тип("РегистрСведенийНаборЗаписей."+ТекущаяСтраница));
			НаборЗаписейРС.УстановитьАктивность(НЕ ТекущаяАктивность);
			ЗначениеВДанныеФормы(НаборЗаписейРС,Объект.Движения[ТекущаяСтраница]);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Для каждого СтрокаДвижения Из Объект.Движения[ТекущаяСтраница] Цикл
		СтрокаДвижения.Активность = (НЕ ТекущаяАктивность);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура КнопкаЗаполнить(Команда)

	Если Объект.СпособЗаполнения <> СпособЗаполненияСторно Тогда
		Возврат;
	КонецЕсли;
	
	Если ЕстьДвижения() Тогда
		ТекстВопроса = НСтр("ru = 'Существующие проводки и движения регистров будут очищены.
			|Продолжить?'");
		Оповещение = Новый ОписаниеОповещения("ВопросЗаполнитьЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		СформироватьДвиженияСторноСервер();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросЗаполнитьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		СформироватьДвиженияСторноСервер();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Сторнирование

&НаСервере
Процедура СформироватьДвиженияСторноСервер()
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаРегистра Из Регистры Цикл
		Если Объект.Движения[СтрокаРегистра.Имя].Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		Объект.Движения[СтрокаРегистра.Имя].Очистить();
	КонецЦикла;

	//Формирование движений
	Если ФлажокСписок Тогда
		ВыполнитьСторнированиеДокументов(Объект.ЗаполнениеДвижений);
	Иначе
		ТЗДокументов = новый ТаблицаЗначений;
		ТЗДокументов.Колонки.Добавить("Документ");
		ТЗДокументов.Добавить().Документ = Объект.СторнируемыйДокумент;
		ВыполнитьСторнированиеДокументов(ТЗДокументов);
	КонецЕсли;
	
	ОбновитьФорму();

КонецПроцедуры

&НаСервере
Процедура ВыполнитьСторнированиеДокументов(СторнируемыеДокументы, СторнироватьРегистры = Истина, СторнироватьПроводки = Истина)

	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	Для каждого СтрокаТЧ Из СторнируемыеДокументы Цикл

		СторнируемыйДокумент = СтрокаТЧ.Документ;
		Если НЕ ЗначениеЗаполнено(СторнируемыйДокумент) Тогда

			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
				"Колонка",
				"Заполнение",
				"Сторнируемый документ",
				СтрокаТЧ.НомерСтроки,
				"Сторнируемые документы");

			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстСообщения,
				Объект,
				,
				"Объект");
			Продолжить;
		КонецЕсли;

		МетаданныеДокумент	= СторнируемыйДокумент.Метаданные();

		Для Каждого МетаданныеРегистр Из МетаданныеДокумент.Движения Цикл

			// если документ "Корректировка регистров" не может иметь таких движений,
			// то это не сторнируемый регистр
			Если НЕ Объект.Движения.Свойство(МетаданныеРегистр.Имя) Тогда
				Продолжить;
			КонецЕсли;

			НаборДвижений = ДокументОбъект.Движения[МетаданныеРегистр.Имя];

			ЭтоРегистрБухгалтерии = Ложь;
			Если СторнироватьПроводки И Метаданные.РегистрыБухгалтерии.Содержит(МетаданныеРегистр) Тогда

				СторнируемыйНаборЗаписей = РегистрыБухгалтерии[МетаданныеРегистр.Имя].СоздатьНаборЗаписей();
				ЭтоРегистрБухгалтерии = Истина;

			ИначеЕсли СторнироватьРегистры И Метаданные.РегистрыНакопления.Содержит(МетаданныеРегистр) Тогда

				СторнируемыйНаборЗаписей = РегистрыНакопления[МетаданныеРегистр.Имя].СоздатьНаборЗаписей();

			Иначе
				Продолжить;
			КонецЕсли;

			СторнируемыйНаборЗаписей.Отбор.Регистратор.Значение = СторнируемыйДокумент;
			СторнируемыйНаборЗаписей.Прочитать();

			Для Каждого ДвижениеСторнируемое Из СторнируемыйНаборЗаписей Цикл

				ДвижениеСторно = НаборДвижений.Добавить();

				// реквизиты
				Если ЭтоРегистрБухгалтерии Тогда
					ЗаполнитьДвиженияСторноПоРегиструБухгалтерии(ДвижениеСторно, ДвижениеСторнируемое, МетаданныеРегистр);
				Иначе
					ЗаполнитьДвижениеСторно(ДвижениеСторно, ДвижениеСторнируемое, МетаданныеРегистр);
				КонецЕсли;

				ДвижениеСторно.Период = Объект.Дата;

			КонецЦикла;

		КонецЦикла;

	КонецЦикла;
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);

КонецПроцедуры

// Копирует значения движения в строку сторно нового движения
// для измерений и реквизитов. Ресурсы инвертируются
//
&НаСервере
Процедура ЗаполнитьДвижениеСторно(Движение, Строка, МетаданныеОбъект)

	ЗаполнитьЗначенияСвойств(Движение, Строка,,"Период,Регистратор,ВидДвижения");

	// вид движения
	Если МетаданныеОбъект.ВидРегистра = Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Остатки Тогда
		Движение.ВидДвижения = Строка.ВидДвижения;
	КонецЕсли;

	// ресурсы
	Для каждого МДОбъект Из МетаданныеОбъект.Ресурсы Цикл
		Если ЗначениеЗаполнено(Строка[МДОбъект.Имя]) Тогда
			Движение[МДОбъект.Имя] = - Строка[МДОбъект.Имя];
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// Копирует значения движения по регистру бухгалтерии в строку сторно
// нового движения для измерений и реквизитов. Ресурсы инвертируются
//
&НаСервере
Процедура ЗаполнитьДвиженияСторноПоРегиструБухгалтерии(Движение, Строка, МетаданныеОбъект)

	ЗаполнитьЗначенияСвойств(Движение, Строка,,"Период,Регистратор");

	// субконто
	Если МетаданныеОбъект.Корреспонденция Тогда
		Для каждого Субконто Из Строка.СубконтоДт Цикл
			Движение.СубконтоДт[Субконто.Ключ] = Субконто.Значение;
		КонецЦикла;
		Для каждого Субконто Из Строка.СубконтоКт Цикл
			Движение.СубконтоКт[Субконто.Ключ] = Субконто.Значение;
		КонецЦикла;
	Иначе
		Для каждого Субконто Из Строка.Субконто Цикл
			Движение.Субконто[Субконто.Ключ] = Субконто.Значение;
		КонецЦикла;
	КонецЕсли;

	// ресурсы
	Для каждого МДОбъект Из МетаданныеОбъект.Ресурсы Цикл
		Если МДОбъект.ПризнакУчета = Неопределено Тогда
			Если ЗначениеЗаполнено(Строка[МДОбъект.Имя]) Тогда
				Движение[МДОбъект.Имя] = - Строка[МДОбъект.Имя];
			КонецЕсли;
		Иначе
			Если МДОбъект.Балансовый Тогда
				Если ЗначениеЗаполнено(Строка[МДОбъект.Имя]) Тогда
					Движение[МДОбъект.Имя] = - Строка[МДОбъект.Имя];
				КонецЕсли;	
			Иначе
				Если ЗначениеЗаполнено(Строка[МДОбъект.Имя + "Дт"]) Тогда
					Движение[МДОбъект.Имя + "Дт"] = - Строка[МДОбъект.Имя + "Дт"];
				КонецЕсли;
				Если ЗначениеЗаполнено(Строка[МДОбъект.Имя + "Кт"]) Тогда
					Движение[МДОбъект.Имя + "Кт"] = - Строка[МДОбъект.Имя + "Кт"];
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

/////////////////////////////////////
// Заполненение движений

&НаСервере
Процедура ОбновитьСписокДействий()

	Элементы.СпособЗаполнения.СписокВыбора.Очистить();
	Элементы.СпособЗаполнения.СписокВыбора.Добавить(СпособЗаполненияВручную,СпособЗаполненияВручную);
	Элементы.СпособЗаполнения.СписокВыбора.Добавить(СпособЗаполненияСторно,СпособЗаполненияСторно);

	Если НЕ ЗначениеЗаполнено(Объект.СпособЗаполнения) Тогда
		Объект.СпособЗаполнения = Элементы.СпособЗаполнения.СписокВыбора[0].Значение;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ЕстьДвижения()

	Для каждого Регистр Из Регистры Цикл
		Если Объект.Движения[Регистр.Имя].Количество()=0 Тогда
			Продолжить;
		КонецЕсли;
		Возврат Истина;
	КонецЦикла;

	Возврат Ложь;

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Настройка состава регистров

&НаСервере
Функция ПодготовитьСписокРегистровДляЕгоНастройки()

	// Актуализируем информацию о наличии движений
	Для Каждого Регистр Из Регистры Цикл
		
		Если НЕ Регистр.Отображение Тогда 
			Продолжить;
		КонецЕсли;
		
		Регистр.ЕстьДвижения = (Объект.Движения[Регистр.Имя].Количество() > 0);
		
	КонецЦикла;
	
	// Поместим таблицу Регистры во временное хранилище
	Возврат ПоместитьВоВременноеХранилище(РеквизитФормыВЗначение("Регистры"), УникальныйИдентификатор);

КонецФункции

&НаСервере
Процедура ПрименитьНастройкуСоставаРегистров(РезультатДействийПользователя)
	
	Для Каждого ИзмененныйРегистр Из РезультатДействийПользователя Цикл
		
		ИмяРегистра = ИзмененныйРегистр.Значение;
		
		// Найдем регистр в коллекции Регистры
		Отбор = Новый Структура("Имя", ИмяРегистра);
		РезультатПоиска = Регистры.НайтиСтроки(Отбор);
		Если РезультатПоиска.Количество() = 0 Тогда
			// Имя регистра неизвестно в этой форме
			Продолжить;
		КонецЕсли;
		Регистр = РезультатПоиска[0];
		
		// Изменим отображение регистра
		Регистр.Отображение = ИзмененныйРегистр.Пометка;
		
		// Удалим данные из отключенных наборов записей
		Если НЕ ИзмененныйРегистр.Пометка Тогда
			Если Объект.Движения[ИмяРегистра].Количество() > 0 Тогда
				Объект.Движения[ИмяРегистра].Очистить();
			КонецЕсли;
			Регистр.ЕстьДвижения = Ложь;
		КонецЕсли;
		
		// Обновим данные в табличных частях ТаблицаРегистровСведений и ТаблицаРегистровНакопления
		Если Регистр.ТипРегистра = "РегистрНакопления" Тогда
			ОбновляемаяКоллекция = Объект.ТаблицаРегистровНакопления;
		ИначеЕсли Регистр.ТипРегистра = "РегистрСведений" Тогда
			ОбновляемаяКоллекция = Объект.ТаблицаРегистровСведений;
		Иначе
			ОбновляемаяКоллекция = Неопределено;
		КонецЕсли;
		
		Если ОбновляемаяКоллекция <> Неопределено Тогда
		
			Отбор = Новый Структура("Имя", Регистр.Имя);
			ОбновляемыеЭлементыКоллекции = ОбновляемаяКоллекция.НайтиСтроки(Отбор);
			
			КоличествоЭлементовКоллекции = ОбновляемыеЭлементыКоллекции.Количество();
			Если КоличествоЭлементовКоллекции > 1 Тогда
				// Удалим все, кроме первого
				Для ИндексЭлемента = 1 По КоличествоЭлементовКоллекции - 1 Цикл
					ОбновляемаяКоллекция.Удалить(ОбновляемыеЭлементыКоллекции[ИндексЭлемента]);
				КонецЦикла;
				КоличествоЭлементовКоллекции = 1;
			КонецЕсли;
			
			РегистрЕстьВКоллекции = (КоличествоЭлементовКоллекции <> 0);
			
			Если Регистр.Отображение И НЕ РегистрЕстьВКоллекции Тогда
				// Добавим регистр в коллекцию
				ОбновляемаяКоллекция.Добавить().Имя = Регистр.Имя;
			ИначеЕсли РегистрЕстьВКоллекции И НЕ Регистр.Отображение Тогда
				// Удалим регистр из коллекции
				ОбновляемаяКоллекция.Удалить(ОбновляемыеЭлементыКоллекции[0]);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
		
	СоздатьЭлементыФормы();

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Отрисовка формы

&НаСервере
Процедура ПодготовитьФормуНаСервере()

	ТекущаяДатаДокумента			= Объект.Дата;
	
	СпособЗаполненияВручную = НСтр("ru = 'Вручную'");
	СпособЗаполненияСторно 	= НСтр("ru = 'Сторно движений документа'");
	ОбновитьСписокДействий();
	
	ФлажокСписок = Объект.ЗаполнениеДвижений.Количество() > 1;
	
	ОбновитьФорму();

	ТекущаяОрганизация = Объект.Организация;

	ОбновлениеОтображения();

КонецПроцедуры

&НаСервере
Процедура ОбновлениеОтображения()

	Если Объект.СпособЗаполнения = СпособЗаполненияВручную Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаИнформация;
		Элементы.ФлажокСписок.Видимость = Ложь;
		ФлажокСписок = Ложь;
	ИначеЕсли Объект.СпособЗаполнения = СпособЗаполненияСторно Тогда
		Элементы.ГруппаСторнирование.Видимость = Истина;
		Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаСторнирование;
		Элементы.ГруппаСторнируемыйДокумент.Видимость = НЕ ФлажокСписок;
		Элементы.ГруппаСписокДокументов.Видимость = ФлажокСписок;
		Элементы.ФлажокСписок.Видимость = Истина;
	КонецЕсли;

	Элементы.ГруппаСписокДокументов.Видимость = ФлажокСписок;

	Если Объект.СпособЗаполнения = СпособЗаполненияСторно Тогда
		Если ФлажокСписок И Объект.ЗаполнениеДвижений.Количество() = 0 Тогда
			Объект.ЗаполнениеДвижений.Добавить();
			Элементы.ЗаполнениеДвижений.ТекущаяСтрока = Объект.ЗаполнениеДвижений[0].ПолучитьИдентификатор();
			Объект.ЗаполнениеДвижений[0].Документ = Объект.СторнируемыйДокумент;
		ИначеЕсли НЕ ФлажокСписок И Объект.ЗаполнениеДвижений.Количество() > 0 Тогда
			Объект.СторнируемыйДокумент = Объект.ЗаполнениеДвижений[0].Документ;
			Объект.ЗаполнениеДвижений.Очистить();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СоздатьЭлементыФормы()

	ПоказатьКнигаУчетаДоходовИРасходов = Ложь;
	ПоказатьРасшифровкаКУДиР           = Ложь;
	ПорядковыйНомер                    = 0;
	КоличествоВидимых                  = 0;
	Всего                              = Регистры.Количество();
	
	Если ТипЗнч(ПериодыРегистров) = Тип("ФиксированныйМассив") Тогда
		ЭлементыПериодов = Новый Массив(ПериодыРегистров);
	Иначе
		ЭлементыПериодов = Новый Массив;
	КонецЕсли;
	
	
	Для каждого СтрокаРегистра Из Регистры Цикл

		ПорядковыйНомер = ПорядковыйНомер + 1;
		КоличествоВидимых = КоличествоВидимых + Число(СтрокаРегистра.Отображение);
		
		Если СтрокаРегистра.Имя = "CW_МСФО" Тогда
			Продолжить;
		КонецЕсли;

		// Создаем страницу для регистра в "правильном" месте между "предопределенными" закладками
		ИмяГруппы = "Группа" + СтрокаРегистра.Имя;
		ТекГруппа = Элементы.Найти(ИмяГруппы);
		Если ТекГруппа = Неопределено И СтрокаРегистра.Отображение Тогда

			//Найдем группу перед которой будем вставлять новую группу
			Для каждого Строка Из Регистры Цикл
				Если Строка.ТипРегистра >= СтрокаРегистра.ТипРегистра
					И Строка.Синоним > СтрокаРегистра.Синоним
					И Строка.Отрисован Тогда

					ВпередиСледующийЭлемент=Элементы["Группа" + Строка.Имя];
					Прервать;

				КонецЕсли;
			КонецЦикла;
			//Если ВпередиСледующийЭлемент = Неопределено Тогда
			//	ВпередиСледующийЭлемент = Элементы["ГруппаCW_МСФО"];
			//КонецЕсли;
			ТекГруппа = Элементы.Вставить(
				ИмяГруппы,
				Тип("ГруппаФормы"),
				Элементы.ПанельРегистров,
				ВпередиСледующийЭлемент);

			ТекГруппа.Заголовок = СтрокаРегистра.Синоним;
			СтрокаРегистра.Отрисован = Истина;

			Если СтрокаРегистра.ТипРегистра = "РегистрБухгалтерии" Тогда
				ТекГруппа.Картинка = БиблиотекаКартинок.РегистрБухгалтерии;
				КартинкаАктивности = БиблиотекаКартинок.АктивностьПоРБ;
			ИначеЕсли СтрокаРегистра.ТипРегистра = "РегистрНакопления" Тогда
				ТекГруппа.Картинка = БиблиотекаКартинок.РегистрНакопления;			
				КартинкаАктивности = БиблиотекаКартинок.АктивностьПоРН;
			ИначеЕсли СтрокаРегистра.ТипРегистра = "РегистрСведений" Тогда
				ТекГруппа.Картинка = БиблиотекаКартинок.РегистрСведений;
				КартинкаАктивности = БиблиотекаКартинок.АктивностьПоРС;
			КонецЕсли;

			// На странице регистра создаем таблицу
			ИмяТаблицы = СтрокаРегистра.Имя;
			ТекТаблица = Элементы.Найти(ИмяТаблицы);
			Если ТекТаблица <> Неопределено Тогда
				Элементы.Удалить(ТекТаблица);
			КонецЕсли;
			ТекТаблица = Элементы.Добавить(ИмяТаблицы, Тип("ТаблицаФормы"), ТекГруппа);
			ТекТаблица.ПутьКДанным = "Объект.Движения." + СтрокаРегистра.Имя;
			// Назначаем общий обработчик
			ТекТаблица.УстановитьДействие("ПриНачалеРедактирования", "Подключаемый_ТаблицаРегистраПриНачалеРедактирования");
			ТекТаблица.КартинкаСтрок = КартинкаАктивности;
			ТекТаблица.ПутьКДаннымКартинкиСтроки = "Объект.Движения." + СтрокаРегистра.Имя+".Активность";

			НоваяКнопка = Элементы.Добавить(ИмяТаблицы+"ПереключитьАктивностьПроводок", Тип("КнопкаФормы"), ТекТаблица.КоманднаяПанель);
			НоваяКнопка.ИмяКоманды = "ПереключитьАктивностьПроводок";

			// Определяем набор колонок для таблицы, соответствующих метаданным регистра
			Если СтрокаРегистра.ТипРегистра = "РегистрНакопления" Тогда
				НаборЗаписей = РегистрыНакопления[СтрокаРегистра.Имя].СоздатьНаборЗаписей();
				МетаданныеРегистра    = Метаданные.РегистрыНакопления[СтрокаРегистра.Имя];
			ИначеЕсли СтрокаРегистра.ТипРегистра = "РегистрСведений" Тогда
				НаборЗаписей = РегистрыСведений[СтрокаРегистра.Имя].СоздатьНаборЗаписей();
				МетаданныеРегистра    = Метаданные.РегистрыСведений[СтрокаРегистра.Имя];
			КонецЕсли;

			РеквизитыНабораЗаписей = НаборЗаписей.ВыгрузитьКолонки();

			// Некоторые колонки не показываем
			РеквизитыНабораЗаписей.Колонки.Удалить("Регистратор");
			РеквизитыНабораЗаписей.Колонки.Удалить("Активность");

			Если РеквизитыНабораЗаписей.Колонки.Найти("МоментВремени") <> Неопределено Тогда
				РеквизитыНабораЗаписей.Колонки.Удалить("МоментВремени");
			КонецЕсли;

			//Если РеквизитыНабораЗаписей.Колонки.Найти("Период") <> Неопределено Тогда
			//	РеквизитыНабораЗаписей.Колонки.Удалить("Период");
			//КонецЕсли;

			Если РеквизитыНабораЗаписей.Колонки.Найти("Организация") <> Неопределено Тогда
				РеквизитыНабораЗаписей.Колонки.Удалить("Организация");
			КонецЕсли;
						
			// Обновление заголовков колонок таблицы по синонимам полей регистра.
			МассивПолейРегистра = Новый Массив;
			МассивПолейРегистра.Добавить("Реквизиты");
			МассивПолейРегистра.Добавить("Измерения");
			МассивПолейРегистра.Добавить("Ресурсы");

			Для каждого ВидПоля Из МассивПолейРегистра Цикл
				Для каждого Поле Из МетаданныеРегистра[ВидПоля] Цикл
					КолонкаТаблицы = РеквизитыНабораЗаписей.Колонки.Найти(Поле.Имя);
					Если КолонкаТаблицы <> Неопределено Тогда
						КолонкаТаблицы.Заголовок = Поле.Синоним;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			
			// Создаем колонки таблицы
			ЭтоПериод = Ложь;
			Для каждого КолонкаРеквизита Из РеквизитыНабораЗаписей.Колонки Цикл
				Если КолонкаРеквизита.Имя = "Период" Тогда
					ЭтоПериод = Истина;
				Иначе
					ЭтоПериод = Ложь;
				КонецЕсли;
				ИмяКолонки = СтрокаРегистра.Имя + КолонкаРеквизита.Имя;
				ТекКолонка = Элементы.Найти(ИмяКолонки);
				Если ТекКолонка = Неопределено Тогда
					ТекКолонка = Элементы.Добавить(ИмяКолонки, Тип("ПолеФормы"), ТекТаблица);
				КонецЕсли;
				ТекКолонка.ПутьКДанным = ТекТаблица.ПутьКДанным + "." + КолонкаРеквизита.Имя;
				ТекКолонка.Заголовок   = КолонкаРеквизита.Заголовок;
				ТекКолонка.Вид = ВидПоляФормы.ПолеВвода;
				Если ЭтоПериод Тогда
					ЭлементыПериодов.Добавить(ИмяКолонки);
					Если НЕ Объект.ПроизвольнаяДатаДвижений Тогда
						ТекКолонка.Видимость = Ложь;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;

		// Делаем страницу регистра невидимой, если она не нужна
		Если ТекГруппа <> Неопределено Тогда
			ТекГруппа.Видимость = СтрокаРегистра.Отображение;
		КонецЕсли;
		
	КонецЦикла;
	
	Элементы.ГруппаCW_МСФО.Видимость = ПолучитьФункциональнуюОпцию("CW_ДоступенБлокУчетаМСФО");
	
	//Если движения только по регистру бухгалтерии то прячем заголовок у панели регистров
	Если КоличествоВидимых <= 1 Тогда
		Элементы.ПанельРегистров.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	Иначе
		Элементы.ПанельРегистров.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
	КонецЕсли;
	
	ПериодыРегистров = Новый ФиксированныйМассив(ЭлементыПериодов);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьФорму()
	
	ЗаполнитьДобавленныеКолонкиТаблиц();

	МетаданныеДокумента = Документы.CW_КорректировкаРегистров.ПустаяСсылка().Метаданные();
	ЗаполнитьТаблицуРегистров(МетаданныеДокумента);
	СоздатьЭлементыФормы();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуРегистров(МетаданныеДокумента = Неопределено)

	Если МетаданныеДокумента = Неопределено Тогда
		МетаданныеДокумента = Объект.Ссылка.Метаданные();
	КонецЕсли;

	Регистры.Очистить();

	Для Каждого МетаданныеРегистра Из МетаданныеДокумента.Движения Цикл

		Регистр     = Регистры.Добавить();
		Регистр.Имя = МетаданныеРегистра.Имя;
		ПолноеИмя   = МетаданныеРегистра.ПолноеИмя();

		ПозицияТочки = Найти(ПолноеИмя, ".");
		ТипРегистра  = Лев(ПолноеИмя, ПозицияТочки - 1);

		Регистр.ТипРегистра = ТипРегистра;
		Регистр.Синоним     = МетаданныеРегистра.Синоним;

		Если Регистр.ТипРегистра = "РегистрНакопления" Тогда
			Регистр.РегистрОстатков = (МетаданныеРегистра.ВидРегистра = Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Остатки);
		КонецЕсли;

		Регистр.ЕстьДвижения = (Объект.Движения[Регистр.Имя].Количество() > 0);
		
		Если Регистр.ЕстьДвижения Тогда
			
			Регистр.Отображение  = Истина;
			
		ИначеЕсли Регистр.Имя = "CW_МСФО" Тогда
			
			Регистр.Отображение  = ПолучитьФункциональнуюОпцию("CW_ДоступенБлокУчетаМСФО");; // Этот регистр отображается в завифимсоти от функциональности

		Иначе
			
			// Отображаем те регистры, которые пользователь отметил флагами
			Отбор = Новый Структура("Имя", Регистр.Имя);
			Если Объект.ТаблицаРегистровНакопления.НайтиСтроки(Отбор).Количество() > 0 Тогда
				Регистр.Отображение  = Истина;
			ИначеЕсли Объект.ТаблицаРегистровСведений.НайтиСтроки(Отбор).Количество() > 0 Тогда
				Регистр.Отображение  = Истина;
			КонецЕсли;
			
		КонецЕсли;

	КонецЦикла;

	// Первым показывается регистр бухгалтерии, затем регистры накопления, затем - сведений
	Регистры.Сортировать("ТипРегистра, Синоним");

КонецПроцедуры


////////////////////////////////////////
// Прочее

&НаСервереБезКонтекста
Функция ПересчитатьСуммуВРублях(ВалютнаяСумма, Валюта, Дата)
	
	КурсВалюты = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Валюта, Дата);
	
	Возврат РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(
		ВалютнаяСумма, 
		Новый Структура("Валюта, Курс, Кратность", Валюта, КурсВалюты.Курс, КурсВалюты.Кратность),
		Новый Структура("Валюта, Курс, Кратность", Константы.ВалютаРегламентированногоУчета.Получить(), 1, 1));
														   
КонецФункции

&НаКлиенте
Процедура ПроизвольнаяДатаДвиженийПриИзменении(Элемент)
	ПриИзмененииВидаДатыДвижений();
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииВидаДатыДвижений()
	
	Для Каждого ЭлМас Из ПериодыРегистров Цикл
		Элементы[ЭлМас].Видимость = Объект.ПроизвольнаяДатаДвижений;
	КонецЦикла;
	
КонецПроцедуры
	
#КонецОбласти
